---
type: RevolvedSurface
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# RevolvedSurface

`Autodesk.Revit.DB.RevolvedSurface` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | GetProfileCurve | 2017 | `public Curve GetProfileCurve ()` |
| Method | GetProfileCurveInWorldCoordinates | 2017_subscription_update | `public Curve GetProfileCurveInWorldCoordinates ()` |
| Method | IsValidProfileCurve | — | `` |
| Property | Axis | 2017 | `public XYZ Axis { get ; }` |
| Property | Origin | 2017 | `public XYZ Origin { get ; }` |
| Property | XDir | 2017 | `public XYZ XDir { get ; }` |
| Property | YDir | 2017 | `public XYZ YDir { get ; }` |